{
  "name": "Oath of Glory",
  "class": "Paladin",
  "description": "Paladins who swear the Oath of Glory believe they and their companions are destined for greatness, striving to achieve legendary deeds that will echo through the ages.",
  "source": "Player's Handbook 2024",
  "features_by_level": {
    "3": {
      "Oath Spells": {
        "description": "You always have certain spells prepared.",
        "spells": {
          "3": [
            "Guiding Bolt",
            "Heroism"
          ],
          "5": [
            "Enhance Ability",
            "Magic Weapon"
          ],
          "9": [
            "Haste",
            "Protection from Energy"
          ],
          "13": [
            "Compulsion",
            "Freedom of Movement"
          ],
          "17": [
            "Commune",
            "Flame Strike"
          ]
        }
      },
      "Peerless Athlete": "As a Channel Divinity Bonus Action, you gain Advantage on Strength (Athletics) and Dexterity (Acrobatics) checks for 10 minutes. During this time, you can add your Charisma modifier (minimum +1) to any Strength check you make, your carrying capacity doubles, and the distance of your Long Jump and High Jump increases by a number of feet equal to your Charisma modifier.",
      "Inspiring Smite": "Immediately after you deal damage with Divine Smite, you can use Channel Divinity to distribute Temporary Hit Points to creatures of your choice within 30 feet (including yourself). Total Temporary HP equals 2d8 + your Paladin level, divided as you choose."
    },
    "7": {
      "Aura of Alacrity": "You and friendly creatures within 10 feet gain a bonus to their Walking Speed equal to 5 feet. At 18th level, range increases to 30 feet."
    },
    "15": {
      "Glorious Defense": "When you or another creature you can see within 10 feet is hit by an attack roll, you can use your Reaction to grant a bonus to the target's AC against that attack equal to your Charisma modifier (minimum +1). If the attack misses, you can make one weapon attack against the attacker as part of this Reaction if the attacker is within your weapon's range. You can use this feature a number of times equal to your Charisma modifier (minimum 1), regaining all uses on Long Rest."
    },
    "20": {
      "Living Legend": "As a Bonus Action, you become an avatar of victory for 1 minute. During this time: You have Advantage on Charisma checks; Once on each of your turns when you miss with a weapon attack, you can cause that attack to hit instead; When you successfully start a grapple or knock a creature Prone using Shove, you can deal Bludgeoning damage equal to your Charisma modifier to the creature. Once used, can't use again until Long Rest."
    }
  }
}